######################################################
# Section 01
# 제어문 if 실습
######################################################

print(type(True))
print(type(False))

# 기본 형식
# if 기본 형태 - 참(또는 거짓)인 경우

# if 기본 형태2 - else

# 관계 연산자
# >, >=, <, <=, ==, !=


# int 변수 a, b

# == 양 변이 같을 때 참.

# != 양 변이 다를 때 참.

# > 왼쪽이 클때 참.

# >= 왼쪽이 크거나 같을 때 참.

# < 오른쪽이 클 때 참.

# <= 오른쪽이 크거나 같을 때 참.

# 참 거짓 예시
# 참: "값", [값], (값), {값}, 1
# 거짓: "", [], (), {}, 0, None

# 조건이 참인 경우 - movie_type = ''


# 조건이 거짓인 경우 - movie_type = 'Comedy'

# 논리 연산자 and, or, not

# 산술, 관계, 논리 우선순위 - 산술 > 관계 > 논리 순서 적용


# 복수의 조건이 모두 참일 경우

# 점수와 학점

# 관리자 사이트 권한


# 다중 조건문
# 자격증 점수


# 중첩 조건문
# 신체검사 키, 몸무게


# in, not in
