######################################################
# Section 01
# 파이썬 분기 처리 퀴즈
# 제어문 if, 반복문 for
######################################################

# Section03
# 파이썬 흐름제어(제어문)
# 제어문 관련 퀴즈

## if
# 1. 학생의 점수 입력 시 학점 계산 기능을 구현하시오.
# A : 90 이상
# B : 80 이상 90 미만
# C : 70 이상 80 미만
# D : 60 이상 70 미만
# F : 60 미만


# 2. 업다운 게임을 구현하시오.
# 기본
# 업 다운 범위 1~50
# 입력한 값 보다 높은 경우 "업" 출력
# 입력한 값 보다 낮은 경우 "다운" 출력
# 맞힌 경우 "정답" 출력
# 심화
# 정답 숫자를 입력 받아서 진행, "0"을 입력 받은 경우 종료
# 참고 기능 : input(), exit(), random()

# 3. 자판기 소프트웨어를 구현하시오.
# 자판기 상품 콜라 1500원 사이다 1500원 물 800원
# 자판기 기능
# 1. 현금 입력(input() 활용)
# 2. 상품 선택
# 3. 상품, 거스름돈 출력(print() 활용)
