######################################################
# Section 02
# 파이썬 데이터 타입 퀴즈
######################################################

################################
# A 데이터 타입
################################
# A-1. '010-0000-2222'의 값을 변수명 phone로 저장

# A-2. 변수 phone에서 뒷 4자리 번호 출력

# A-3. 영화의 장르 코미디, 액션, 로맨스를 리스트 변수명 movie_type로 저장

# A-4. movie_type의 변수에 '스릴러' 장르를 추가

# A-5. number 변수에 '880616-1413429' 값을 저장

# A-6. number 변수에서 성별을 출력
# * 주민번호 첫 번째 값이 1인 경우 남성, 2인 경우 여성

# A-8. age 변수에 문자열 '36'을 저장하고 int형으로 형변환

# A-9. 자판기를 만든다는 과정을 두고 자판기에는 콜라 1500원 사이다 1500원 물 800원을 products 변수에 저장하시오.

# A-10. application 변수에 리스트 형태의 1,2,3,4,5,1,2,3,4,5 값을 저장

# A-11. application 변수를 set() 데이터 타입으로 형변환

################################
# B 연산자
################################
# B-1.

# B-2. 홍길동 38살, 홍길순 42살, 홍삼 10살이 있다 나이의 평균과 합을 출력하시오.

# B-3. 자신의 출생 년도를 입력 시 홀수 인지 짝수 인지 구분하는 기능을 구현하시오
# * 예) 2000의 경우 0 출력, 2001의 경우 1 출력

# B-4. 임의의 원화를 입력 시 1000원, 500원, 100원과 잔돈을 계산하는 기능을 구현하시오
