######################################################
# Section 01
# 파이썬 데이터 타입(자료형) 실습
######################################################

'''
[파이썬 자료형]
   int : 정수
   float : 실수
   str : 문자열
   list : 리스트
   tuple : 튜플
   set : 집합
   dict : 사전
'''

'''
[연산자]
산술 연산자
   + : 더하기
   - : 빼기
   * : 곱하기
   ** : 제곱
   / : 나누기
   // : 나누기 몫
   % : 나누기 나머지

비교 연산자
   == : 값이 같다면
   != : 값이 같지 않다면
   > : 왼쪽 값이 더 크다면
   < : 오른쪽 값이 더 크다면
   >= : 왼쪽 값이 크거나 같다면
   <= : 오른쪽 값이 크거나 같다면

논리 연산자
   and : 좌우 조건문이 참(ture)인 경우
   or : 좌우 조건문 중 하나라도 참(true)인 경우
   not : 조건문 자체가 거짓인 경우

[참고 함수]

   print() : 데이터 출력
   type() : 데이터 타입 확인
   id() : 객체 고유값 확인
'''

# int : 정수


# float : 실수


# str : 문자열


# list : 리스트


# tuple : 튜플


# set : 집합


# dict : 사전


# 형변환
